spec/cassettes/finalize_success.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: card[number]=4242424242424242&card[exp_month]=12&card[exp_year]=30&card[cvc]=222&metadata[country_code]=NL&metadata[is_company]=false&metadata[other]=random
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '156'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 25 Jul 2014 12:32:22 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1396'
      Cache-Control:
      - no-cache, no-store
      Stripe-Version:
      - '2014-03-13'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Max-Age:
      - '300'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1406291541,
          "id": "cus_4T40RvzvBYNvvU",
          "livemode": false,
          "description": null,
          "email": null,
          "delinquent": false,
          "metadata": {
            "country_code": "NL",
            "is_company": "false",
            "other": "random"
          },
          "subscriptions": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/customers/cus_4T40RvzvBYNvvU/subscriptions",
            "data": [],
            "count": 0
          },
          "discount": null,
          "account_balance": 0,
          "currency": null,
          "cards": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_4T40RvzvBYNvvU/cards",
            "data": [
              {
                "id": "card_14K7s12nHroS7mLXGc5gwv5v",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 12,
                "exp_year": 2030,
                "fingerprint": "0K7oMWAQAFG7TEob",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "customer": "cus_4T40RvzvBYNvvU",
                "type": "Visa"
              }
            ],
            "count": 1
          },
          "default_card": "card_14K7s12nHroS7mLXGc5gwv5v"
        }
    http_version: 
  recorded_at: Fri, 25 Jul 2014 12:32:22 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/invoiceitems
    body:
      encoding: US-ASCII
      string: customer=cus_4T40RvzvBYNvvU&amount=100&currency=usd
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '51'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 25 Jul 2014 12:32:23 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '292'
      Cache-Control:
      - no-cache, no-store
      Stripe-Version:
      - '2014-03-13'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Max-Age:
      - '300'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "invoiceitem",
          "id": "ii_14K7s22nHroS7mLXQpzTHIOD",
          "date": 1406291542,
          "amount": 100,
          "livemode": false,
          "proration": false,
          "currency": "usd",
          "customer": "cus_4T40RvzvBYNvvU",
          "description": null,
          "metadata": {},
          "invoice": null,
          "subscription": null
        }
    http_version: 
  recorded_at: Fri, 25 Jul 2014 12:32:23 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/invoices
    body:
      encoding: US-ASCII
      string: customer=cus_4T40RvzvBYNvvU
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '27'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 25 Jul 2014 12:32:23 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1265'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Stripe-Version:
      - '2014-03-13'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Max-Age:
      - '300'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "date": 1406291543,
          "id": "in_14K7s32nHroS7mLXUBZm5HSr",
          "period_start": 1406291543,
          "period_end": 1406291543,
          "lines": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/invoices/in_14K7s32nHroS7mLXUBZm5HSr/lines",
            "data": [
              {
                "id": "ii_14K7s22nHroS7mLXQpzTHIOD",
                "object": "line_item",
                "type": "invoiceitem",
                "livemode": false,
                "amount": 100,
                "currency": "usd",
                "proration": false,
                "period": {
                  "start": 1406291542,
                  "end": 1406291542
                },
                "quantity": null,
                "plan": null,
                "description": null,
                "metadata": {}
              }
            ],
            "count": 1
          },
          "subtotal": 100,
          "total": 100,
          "customer": "cus_4T40RvzvBYNvvU",
          "object": "invoice",
          "attempted": false,
          "closed": false,
          "forgiven": false,
          "paid": false,
          "livemode": false,
          "attempt_count": 0,
          "amount_due": 100,
          "currency": "usd",
          "starting_balance": 0,
          "ending_balance": null,
          "next_payment_attempt": 1406295143,
          "webhooks_delivered_at": null,
          "charge": null,
          "discount": null,
          "application_fee": null,
          "subscription": null,
          "metadata": {},
          "statement_description": null,
          "description": null
        }
    http_version: 
  recorded_at: Fri, 25 Jul 2014 12:32:24 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_4T40RvzvBYNvvU
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 25 Jul 2014 12:32:24 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1397'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Stripe-Version:
      - '2014-03-13'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Max-Age:
      - '300'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1406291541,
          "id": "cus_4T40RvzvBYNvvU",
          "livemode": false,
          "description": null,
          "email": null,
          "delinquent": false,
          "metadata": {
            "country_code": "NL",
            "is_company": "false",
            "other": "random"
          },
          "subscriptions": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/customers/cus_4T40RvzvBYNvvU/subscriptions",
            "data": [],
            "count": 0
          },
          "discount": null,
          "account_balance": 0,
          "currency": "usd",
          "cards": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_4T40RvzvBYNvvU/cards",
            "data": [
              {
                "id": "card_14K7s12nHroS7mLXGc5gwv5v",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 12,
                "exp_year": 2030,
                "fingerprint": "0K7oMWAQAFG7TEob",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "customer": "cus_4T40RvzvBYNvvU",
                "type": "Visa"
              }
            ],
            "count": 1
          },
          "default_card": "card_14K7s12nHroS7mLXGc5gwv5v"
        }
    http_version: 
  recorded_at: Fri, 25 Jul 2014 12:32:24 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/invoiceitems
    body:
      encoding: US-ASCII
      string: customer=cus_4T40RvzvBYNvvU&invoice=in_14K7s32nHroS7mLXUBZm5HSr&amount=21&currency=usd&description=VAT
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '102'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 25 Jul 2014 12:32:25 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '317'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Stripe-Version:
      - '2014-03-13'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Max-Age:
      - '300'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "invoiceitem",
          "id": "ii_14K7s52nHroS7mLXNCG7gDWP",
          "date": 1406291545,
          "amount": 21,
          "livemode": false,
          "proration": false,
          "currency": "usd",
          "customer": "cus_4T40RvzvBYNvvU",
          "description": "VAT",
          "metadata": {},
          "invoice": "in_14K7s32nHroS7mLXUBZm5HSr",
          "subscription": null
        }
    http_version: 
  recorded_at: Fri, 25 Jul 2014 12:32:25 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/invoices/in_14K7s32nHroS7mLXUBZm5HSr
    body:
      encoding: US-ASCII
      string: metadata[country_code]=NL&metadata[is_company]=false&metadata[other]=random
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '75'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 25 Jul 2014 12:32:26 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1762'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Stripe-Version:
      - '2014-03-13'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Max-Age:
      - '300'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "date": 1406291543,
          "id": "in_14K7s32nHroS7mLXUBZm5HSr",
          "period_start": 1406291543,
          "period_end": 1406291543,
          "lines": {
            "object": "list",
            "total_count": 2,
            "has_more": false,
            "url": "/v1/invoices/in_14K7s32nHroS7mLXUBZm5HSr/lines",
            "data": [
              {
                "id": "ii_14K7s22nHroS7mLXQpzTHIOD",
                "object": "line_item",
                "type": "invoiceitem",
                "livemode": false,
                "amount": 100,
                "currency": "usd",
                "proration": false,
                "period": {
                  "start": 1406291542,
                  "end": 1406291542
                },
                "quantity": null,
                "plan": null,
                "description": null,
                "metadata": {}
              },
              {
                "id": "ii_14K7s52nHroS7mLXNCG7gDWP",
                "object": "line_item",
                "type": "invoiceitem",
                "livemode": false,
                "amount": 21,
                "currency": "usd",
                "proration": false,
                "period": {
                  "start": 1406291545,
                  "end": 1406291545
                },
                "quantity": null,
                "plan": null,
                "description": "VAT",
                "metadata": {}
              }
            ],
            "count": 2
          },
          "subtotal": 121,
          "total": 121,
          "customer": "cus_4T40RvzvBYNvvU",
          "object": "invoice",
          "attempted": false,
          "closed": false,
          "forgiven": false,
          "paid": false,
          "livemode": false,
          "attempt_count": 0,
          "amount_due": 121,
          "currency": "usd",
          "starting_balance": 0,
          "ending_balance": null,
          "next_payment_attempt": 1406295143,
          "webhooks_delivered_at": null,
          "charge": null,
          "discount": null,
          "application_fee": null,
          "subscription": null,
          "metadata": {
            "country_code": "NL",
            "is_company": "false",
            "other": "random"
          },
          "statement_description": null,
          "description": null
        }
    http_version: 
  recorded_at: Fri, 25 Jul 2014 12:32:26 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/invoices?customer=cus_4T40RvzvBYNvvU
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 25 Jul 2014 12:32:27 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '2166'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Stripe-Version:
      - '2014-03-13'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Max-Age:
      - '300'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "list",
          "has_more": false,
          "url": "/v1/invoices",
          "data": [
            {
              "date": 1406291543,
              "id": "in_14K7s32nHroS7mLXUBZm5HSr",
              "period_start": 1406291543,
              "period_end": 1406291543,
              "lines": {
                "object": "list",
                "total_count": 2,
                "has_more": false,
                "url": "/v1/invoices/in_14K7s32nHroS7mLXUBZm5HSr/lines",
                "data": [
                  {
                    "id": "ii_14K7s22nHroS7mLXQpzTHIOD",
                    "object": "line_item",
                    "type": "invoiceitem",
                    "livemode": false,
                    "amount": 100,
                    "currency": "usd",
                    "proration": false,
                    "period": {
                      "start": 1406291542,
                      "end": 1406291542
                    },
                    "quantity": null,
                    "plan": null,
                    "description": null,
                    "metadata": {}
                  },
                  {
                    "id": "ii_14K7s52nHroS7mLXNCG7gDWP",
                    "object": "line_item",
                    "type": "invoiceitem",
                    "livemode": false,
                    "amount": 21,
                    "currency": "usd",
                    "proration": false,
                    "period": {
                      "start": 1406291545,
                      "end": 1406291545
                    },
                    "quantity": null,
                    "plan": null,
                    "description": "VAT",
                    "metadata": {}
                  }
                ],
                "count": 2
              },
              "subtotal": 121,
              "total": 121,
              "customer": "cus_4T40RvzvBYNvvU",
              "object": "invoice",
              "attempted": false,
              "closed": false,
              "forgiven": false,
              "paid": false,
              "livemode": false,
              "attempt_count": 0,
              "amount_due": 121,
              "currency": "usd",
              "starting_balance": 0,
              "ending_balance": null,
              "next_payment_attempt": 1406295143,
              "webhooks_delivered_at": null,
              "charge": null,
              "discount": null,
              "application_fee": null,
              "subscription": null,
              "metadata": {
                "country_code": "NL",
                "is_company": "false",
                "other": "random"
              },
              "statement_description": null,
              "description": null
            }
          ],
          "count": 1
        }
    http_version: 
  recorded_at: Fri, 25 Jul 2014 12:32:27 GMT
recorded_with: VCR 2.9.2
